{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<style>.container { width:80%; align-left:10% !important; }</style>"
      ],
      "text/plain": [
       "<IPython.core.display.HTML object>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "from IPython.display import display, HTML\n",
    "display(HTML(\"<style>.container { width:80%; align-left:10% !important; }</style>\"))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [],
   "source": [
    "%reset -s -f"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [],
   "source": [
    "import numpy as np\n",
    "import pandas as pd\n",
    "import datetime as dt\n",
    "from matplotlib import cm\n",
    "# import autopep8\n",
    "import matplotlib.pyplot as plt\n",
    "# import networkx as nx\n",
    "import random\n",
    "import warnings\n",
    "warnings.filterwarnings(\"ignore\")\n",
    "from numpy import random\n",
    "import plotly.express as px\n",
    "# import cufflinks as cf\n",
    "import plotly.graph_objects as go\n",
    "import matplotlib.colors as colors\n",
    "\n",
    "# import matplotlib.cm as cmx\n",
    "# from matplotlib import cm\n",
    "\n",
    "import sys\n",
    "sys.path.insert(0,'..')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [],
   "source": [
    "from gremlin_python.process.anonymous_traversal import traversal\n",
    "from gremlin_python.driver.driver_remote_connection import DriverRemoteConnection"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [],
   "source": [
    "from gremlin_python.process.traversal import Cardinality\n",
    "from gremlin_python.process.traversal import T\n",
    "id = T.id\n",
    "single = Cardinality.single"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [],
   "source": [
    "# !pip install nest_asyncio\n",
    "import nest_asyncio\n",
    "nest_asyncio.apply()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 40,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "False\n"
     ]
    }
   ],
   "source": [
    "try:\n",
    "    print(in_papermill)\n",
    "except:\n",
    "    in_papermill=False\n",
    "    print(in_papermill)\n",
    "if in_papermill:\n",
    "    gremlin_conn = {\n",
    "        \"Host\": gremlin_host,\n",
    "        \"Port\": gremlin_port,}\n",
    "else:\n",
    "    gremlin_conn = {\n",
    "        \"Host\": \"localhost\",\n",
    "        \"Port\": \"8182\",}"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1. Connect to Gremlin Server\n",
      "14090\n"
     ]
    }
   ],
   "source": [
    "\n",
    "\n",
    "print(\"1. Connect to Gremlin Server\")\n",
    "for key in gremlin_conn.keys():\n",
    "    if gremlin_conn[key] is None or len(gremlin_conn[key]) == 0:\n",
    "        print(\"Enter {}\".format(key))\n",
    "        gremlin_conn[key] = input()\n",
    "\n",
    "try:\n",
    "    conn_gremlin = DriverRemoteConnection('ws://{}:{}/gremlin'.format(gremlin_conn[\"Host\"], gremlin_conn[\"Port\"], 'g'))\n",
    "    g = traversal().withRemote(conn_gremlin)\n",
    "except Exception as e:\n",
    "    print(\"Connect to Gremlin Server failed, {}\".format(e))\n",
    "    exit()\n",
    "print(g.V().count().next())"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Number of Nodes 14090\n",
      "Number of Edges 40609\n"
     ]
    }
   ],
   "source": [
    "print('Number of Nodes', g.V().count().next())\n",
    "print('Number of Edges', g.E().count().next())"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [],
   "source": [
    "# txms = 'Ford.F-150.2020.2WD_Reg_Cab_Box.Canada_Spec'\n",
    "# txms = 'Subaru.Outback.2018.2.5i.Canada_Spec'\n",
    "txms = 'TOYOTA.Corolla.2020.4D_SEDAN_LE.Canada_Spec'\n",
    "# txms = 'Jeep.Wrangler_Unlimited.2020.Sahara_4x4.Canada_Spec'\n",
    "# txms = 'Land_Rover.Range_Rover.2015.4WD_4dr__SWB_SC_Autobiography.Canada_Spec'"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [],
   "source": [
    "# xy_day = [(y[0][list(y[0].keys())[0]], y[1]) for y in [[l[list(l.keys())[2]], l['value']] for l in g.V().hasLabel(\n",
    "#     txms).outE().has('time_type', 'day').elementMap().toList()]]\n",
    "# xy_day = sorted(xy_day)\n",
    "# xy_day"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [],
   "source": [
    "# df_day = pd.DataFrame(data=[l[1] for l in xy_day],    # values\n",
    "#                       index=[l[0] for l in xy_day],    # 1st column as index\n",
    "#                       columns=['value'])\n",
    "# df_day.index = [str(l)[0:4] + '-' + str(l)[4:6] + '-' + str(l)[6:8] for l in df_day.index.values]\n",
    "# df_day.index = pd.to_datetime(df_day.index)\n",
    "# df_day.index.names = ['date']\n",
    "# df_day['5_average'] = df_day['value'].rolling(5).mean()\n",
    "# df_day['10_average'] = df_day['value'].rolling(10).mean()\n",
    "# df_day.reset_index(inplace= True)\n",
    "# df_day.head(2)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {},
   "outputs": [],
   "source": [
    "# xy_month = [(y[0][list(y[0].keys())[0]], y[1]) for y in [[l[list(l.keys())[2]], l['value']] for l in g.V().hasLabel(\n",
    "#     txms).outE().has('time_type', 'month').elementMap().toList()]]\n",
    "# xy_month = sorted(xy_month)\n",
    "# xy_month"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {},
   "outputs": [],
   "source": [
    "# df_month = pd.DataFrame(data=[l[1] for l in xy_month],    # values\n",
    "#                         index=[l[0] for l in xy_month],    # 1st column as index\n",
    "#                         columns=['value'])\n",
    "# df_month.index = [str(l)[0:4] + '-' + str(l)[4:6] for l in df_month.index.values]\n",
    "# df_month.index = pd.to_datetime(df_month.index)\n",
    "# df_month.index.names = ['date']\n",
    "# df_month['5_average'] = df_month['value'].rolling(5).mean()\n",
    "# df_month['10_average'] = df_month['value'].rolling(10).mean()\n",
    "# df_month.reset_index(inplace= True)\n",
    "# df_month.head(2)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {},
   "outputs": [],
   "source": [
    "# xy_year = [(y[0][list(y[0].keys())[0]], y[1]) for y in [[l[list(l.keys())[2]], l['value']] for l in g.V().hasLabel(\n",
    "#     txms).outE().has('time_type', 'year').elementMap().toList()]]\n",
    "# xy_year = sorted(xy_year)\n",
    "# xy_year"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "metadata": {},
   "outputs": [],
   "source": [
    "# df_year = pd.DataFrame(data=[l[1] for l in xy_year],    # values\n",
    "#                         index=[l[0] for l in xy_year],    # 1st column as index\n",
    "#                         columns=['value'])\n",
    "# df_year.index = [str(l) for l in df_year.index.values]\n",
    "# df_year.index = pd.to_datetime(df_year.index)\n",
    "# df_year.index.names = ['date']\n",
    "# df_year['5_average'] = df_year['value'].rolling(5).mean()\n",
    "# df_year['10_average'] = df_year['value'].rolling(10).mean()\n",
    "# df_year.reset_index(inplace= True)\n",
    "# df_year.head(2)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "metadata": {},
   "outputs": [],
   "source": [
    "# plt.plot([l[0] for l in xy_month], [l[1] for l in xy_month])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {},
   "outputs": [],
   "source": [
    "# fig = go.Figure()\n",
    "# dfs = {'daily':df_day, 'monthly': df_month, 'yearly' :df_year}\n",
    "\n",
    "# # your setup this far...\n",
    "\n",
    "# # ... here is where I've added my contributions:\n",
    "\n",
    "# # specify visibility for traces accross dataframes\n",
    "# frames = len(dfs) # number of dataframes organized in  dict\n",
    "# columns = len(dfs['daily'].columns) - 1 # number of columns i df, minus 1 for Date\n",
    "# scenarios = [list(s) for s in [e==1 for e in np.eye(frames)]]\n",
    "# visibility = [list(np.repeat(e, columns)) for e in scenarios] \n",
    "\n",
    "# # container for buttons\n",
    "# buttons = []\n",
    "\n",
    "# # iterate of dataframes in dfs:\n",
    "# # - i is used to reference visibility attributes\n",
    "# # - k is the name for each dataframe\n",
    "# # - v is the dataframe itself\n",
    "# for i, (k, v) in enumerate(dfs.items()):\n",
    "# #     print(i)\n",
    "#     for c, column in enumerate(v.columns[1:]):\n",
    "#         fig.add_scatter(name = column,\n",
    "#                         x = v['date'],\n",
    "#                         y = v[column], \n",
    "#                         visible=True if k=='daily' else False # 'daily' values are shown from the start\n",
    "#                        )\n",
    "# #         fig.add_ohlc(x=v['date'],\n",
    "# #                 open=v[column],\n",
    "# #                 high=v[column],\n",
    "# #                 low=v[column],\n",
    "# #                 close=v[column],\n",
    "# #                 visible=True if k=='daily' else False # 'daily' values are shown from the start\n",
    "# #                     )\n",
    "                \n",
    "#     # one button per dataframe to trigger the visibility\n",
    "#     # of all columns / traces for each dataframe\n",
    "#     button =  dict(label=k,\n",
    "#                    method = 'restyle',\n",
    "#                    args = ['visible',visibility[i]])\n",
    "#     buttons.append(button)\n",
    "\n",
    "# # include dropdown updatemenu in layout\n",
    "# fig.update_layout(title=f\"value of {txms}\",\n",
    "#                   updatemenus=[dict(type=\"buttons\",\n",
    "#                                     direction=\"right\",\n",
    "#                                     x=0.8,\n",
    "#                                     y=1.1,\n",
    "#                                     buttons = buttons,\n",
    "#                                     xanchor=\"left\",\n",
    "#                                     yanchor=\"bottom\",\n",
    "#                                    )])\n",
    "# fig.show()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "metadata": {},
   "outputs": [],
   "source": [
    "# makes_list = set([x['make'] for x in g.V().has('node_type', 'CarType').elementMap().toList()])\n",
    "# models_list = set([x['model'] for x in g.V().has('node_type', 'CarType').elementMap().toList()])\n",
    "# years_list = set([x['year'] for x in g.V().has('node_type', 'CarType').elementMap().toList()])\n",
    "# trims_list = set([x['trim'] for x in g.V().has('node_type', 'CarType').elementMap().toList()])\n",
    "# locations_list = ['CA_default', 'CA_us']\n",
    "# txms_list = [x[list(x.keys())[1]] for x in g.V().has('node_type', 'CarType').elementMap().toList()]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "metadata": {},
   "outputs": [],
   "source": [
    "makes_list = list(set([x['make'] for x in g.V().has('node_type', 'CarType').elementMap().toList()]))\n",
    "models_list = list(set([x['model'] for x in g.V().has('node_type', 'CarType').elementMap().toList()]))\n",
    "years_list = list(set([x['year'] for x in g.V().has('node_type', 'CarType').elementMap().toList()]))\n",
    "trims_list = list(set([x['trim'] for x in g.V().has('node_type', 'CarType').elementMap().toList()]))\n",
    "locations_list = ['All', 'CA', 'US']  # ['All', 'CA_default', 'CA_us']\n",
    "txms_list = list(set([x[list(x.keys())[1]] for x in g.V().has('node_type', 'CarType').elementMap().toList()]))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "metadata": {},
   "outputs": [],
   "source": [
    "make_model_list = list(set([f\"{x['make']}_{x['model']}\" for x in g.V().has('node_type', 'CarType').elementMap().toList()]))\n",
    "# make_model_list"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "metadata": {},
   "outputs": [],
   "source": [
    "import plotly.express as px\n",
    "from jupyter_dash import JupyterDash\n",
    "import dash_core_components as dcc\n",
    "import dash_html_components as html\n",
    "from dash.dependencies import Input, Output\n",
    "from plotly.subplots import make_subplots"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "metadata": {},
   "outputs": [],
   "source": [
    "# my_array = [[y[0][list(y[0].keys())[0]], y[1]] for y in [[l[list(l.keys())[2]], l['value']] for l in g.V().has(\n",
    "#     'make', 'TOYOTA').has('model', 'Corolla').outE().has('time_type', 'day').elementMap().toList()]]\n",
    "# df = pd.DataFrame(my_array, columns = ['day','Cars_Baseline_Price'])\n",
    "# df = df.groupby('day').mean().sort_values(by=['day'])\n",
    "# df.index.name = None\n",
    "# df"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "metadata": {},
   "outputs": [],
   "source": [
    "# xy_day_car = [(y[0][list(y[0].keys())[0]], y[1]) for y in [[l[list(l.keys())[2]], l['value']] for l in g.V().has(\n",
    "#     'make', 'TOYOTA').has('model', 'Corolla').outE().has('time_type', 'day').elementMap().toList()]]\n",
    "# xy_day_car = sorted(xy_day_car)\n",
    "# df_day_car = pd.DataFrame(data=[l[1] for l in xy_day_car],    # values\n",
    "#                       index=[l[0] for l in xy_day_car],    # 1st column as index\n",
    "#                       columns=['Cars_Baseline_Price'])\n",
    "# df_day_car.head()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "metadata": {},
   "outputs": [],
   "source": [
    "# default_make_model = 'TOYOTA_Corolla'\n",
    "# default_make_model = 'FORD_ESCAPE_4WD'\n",
    "# default_make_model = 'AUDI_RS_Q8'\n",
    "default_make_model = 'JEEP_Wrangler'"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "metadata": {},
   "outputs": [],
   "source": [
    "# xy_day_car = [[y[0][list(y[0].keys())[0]], y[1]] for y in [[l[list(l.keys())[2]], l['value']] for l in g.V().has(\n",
    "#     'make', make).has('model', model).outE().has('time_type', 'day').elementMap().toList()]]\n",
    "# df_day_car = pd.DataFrame(xy_day_car, columns = ['day','Cars_Baseline_Price'])\n",
    "# df_day_car = df_day_car.groupby('day').mean().sort_values(by=['day'])\n",
    "# #     df_day_car.index.name = None\n",
    "# df_day_car.index = [str(l)[0:4] + '-' + str(l)[4:6] + '-' + str(l)[6:8] for l in df_day_car.index.values]\n",
    "# df_day_car.index = pd.to_datetime(df_day_car.index)\n",
    "# df_day_car.index.names = ['date']\n",
    "# df_day_car['Cars_Baseline_Price_5_Moving_Average'] = df_day_car['Cars_Baseline_Price'].rolling(5).mean()\n",
    "# df_day_car['Cars_Baseline_Price_10_Moving_Average'] = df_day_car['Cars_Baseline_Price'].rolling(10).mean()\n",
    "# df_day_car.reset_index(inplace= True)\n",
    "# df_day_car.head(20)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 26,
   "metadata": {},
   "outputs": [],
   "source": [
    "# df_day_car_tmp = df_day_car.copy()\n",
    "# df_day_car_tmp['date'] = df_day_car_tmp['date'].astype('datetime64[ns]')\n",
    "# dfmon = df_day_car_tmp.resample('M', on='date').mean()\n",
    "# dfmon.reset_index(inplace= True)\n",
    "\n",
    "# # dfmon = dfmon[['date', 'Cars_Baseline_Price']]\n",
    "# display(dfmon.head())\n",
    "\n",
    "# # dfyr = eval_df_sample_traverse_total_reset.resample('AS').mean()\n",
    "# # dfyr.reset_index(inplace= True)\n",
    "# # dfyr = dfyr[['date', 'price']]\n",
    "# # display(dfyr.head())"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 27,
   "metadata": {},
   "outputs": [],
   "source": [
    "# fx_dict = {'EURUSD':'EURUSD', 'USDCAD':'CADUSD', 'USDMXN':'MXNUSD', 'USDZAR':'ZARUSD'}\n",
    "fx_dict = {'EURUSD':'EURUSD', 'CADUSD':'USDCAD', 'MXNUSD':'USDMXN', 'ZARUSD':'USDZAR'}\n",
    "fx_inv_dict = {'EURUSD': False, 'CADUSD':True, 'MXNUSD':True, 'ZARUSD':True}"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 28,
   "metadata": {
    "scrolled": false
   },
   "outputs": [],
   "source": [
    "app = JupyterDash(__name__)\n",
    "app.layout = html.Div([\n",
    "    html.H1(\"End to End Cross-Asset Graph\"),\n",
    "    dcc.Graph(id='graph'),\n",
    "    html.Label([\n",
    "        \"Make_Model\",\n",
    "        dcc.Dropdown(\n",
    "            id='make_model-dropdown', clearable=False,\n",
    "            value=default_make_model, options=[\n",
    "                {'label': c, 'value': c}\n",
    "                for c in make_model_list\n",
    "            ]),\n",
    "    ]),\n",
    "    html.Label([\n",
    "        \"Location\",\n",
    "        dcc.Dropdown(\n",
    "            id='location-dropdown', clearable=False,\n",
    "            value=locations_list[0], options=[\n",
    "                {'label': c, 'value': c}\n",
    "                for c in locations_list\n",
    "            ]),\n",
    "    ]),\n",
    "    html.Label([\n",
    "        \"Financial Asset\",\n",
    "        dcc.Dropdown(\n",
    "            id='fx-dropdown', clearable=False,\n",
    "            value=list(fx_dict.keys())[0], options=[\n",
    "                {'label': c, 'value': c}\n",
    "                for c in list(fx_dict.keys())\n",
    "            ]),\n",
    "    ]),\n",
    "])\n",
    "\n",
    "# Define callback to update graph\n",
    "@app.callback(\n",
    "    Output('graph', 'figure'),\n",
    "    [Input(\"make_model-dropdown\", \"value\"), Input(\"location-dropdown\", \"value\"), Input(\"fx-dropdown\", \"value\")]\n",
    ")\n",
    "def update_figure(make_model, location, fx_raw):\n",
    "    fx = fx_dict[fx_raw]\n",
    "    fx_inv = fx_inv_dict[fx_raw]\n",
    "    make = make_model.split('_')[0]\n",
    "    model = make_model.split('_')[1]\n",
    "    if len(make_model.split('_')) >= 2:\n",
    "        model = '_'.join(make_model.split('_')[1:])\n",
    "\n",
    "    \n",
    "    fig = make_subplots(specs=[[{\"secondary_y\": True}]])\n",
    "    \n",
    "    if location == 'All':\n",
    "        value_key = 'value'\n",
    "    elif location == 'CA':\n",
    "        value_key = 'value_ca'\n",
    "    elif location == 'US':\n",
    "        value_key = 'value_us'\n",
    "        \n",
    "    xy_day_car = [[y[0][list(y[0].keys())[0]], y[1]] for y in [[l[list(l.keys())[2]], l[value_key]] for l in g.V().has(\n",
    "        'make', make).has('model', model).outE().has('time_type', 'day').elementMap().toList()]]\n",
    "    df_day_car = pd.DataFrame(xy_day_car, columns = ['day','Vehicle_Asset'])\n",
    "    df_day_car['Vehicle_Asset'] = df_day_car['Vehicle_Asset']/1.27\n",
    "    df_day_car = df_day_car.groupby('day').mean().sort_values(by=['day'])\n",
    "#     df_day_car.index.name = None\n",
    "    df_day_car.index = [str(l)[0:4] + '-' + str(l)[4:6] + '-' + str(l)[6:8] for l in df_day_car.index.values]\n",
    "    df_day_car.index = pd.to_datetime(df_day_car.index)\n",
    "    df_day_car.index.names = ['date']\n",
    "    df_day_car['Vehicle_Asset_5_Moving_Average'] = df_day_car['Vehicle_Asset'].rolling(5).mean()\n",
    "    df_day_car['Vehicle_Asset_10_Moving_Average'] = df_day_car['Vehicle_Asset'].rolling(10).mean()\n",
    "    df_day_car.reset_index(inplace= True)\n",
    "\n",
    "#     xy_month_car = [[y[0][list(y[0].keys())[0]], y[1]] for y in [[l[list(l.keys())[2]], l['value']] for l in g.V().has(\n",
    "#         'make', make).has('model', model).outE().has('time_type', 'month').elementMap().toList()]]\n",
    "#     df_month_car = pd.DataFrame(xy_month_car, columns = ['month','Cars_Baseline_Price'])\n",
    "#     df_month_car = df_month_car.groupby('month').mean().sort_values(by=['month'])\n",
    "# #     df_month_car.index.name = None\n",
    "#     df_month_car.index = [str(l)[0:4] + '-' + str(l)[4:6] for l in df_month_car.index.values]\n",
    "#     df_month_car.index = pd.to_datetime(df_month_car.index)\n",
    "#     df_month_car.index.names = ['date']\n",
    "#     df_month_car['Cars_Baseline_Price_5_Moving_Average'] = df_month_car['Cars_Baseline_Price'].rolling(5).mean()\n",
    "#     df_month_car['Cars_Baseline_Price_10_Moving_Average'] = df_month_car['Cars_Baseline_Price'].rolling(10).mean()\n",
    "#     df_month_car.reset_index(inplace= True)\n",
    "    df_day_car_tmp = df_day_car.copy()\n",
    "    df_day_car_tmp['date'] = df_day_car_tmp['date'].astype('datetime64[ns]')\n",
    "    df_month_car = df_day_car_tmp.resample('M', on='date').mean()\n",
    "    df_month_car.reset_index(inplace= True)\n",
    "#     display(df_month_car.head())\n",
    "    \n",
    "    xy_year_car = [[y[0][list(y[0].keys())[0]], y[1]] for y in [[l[list(l.keys())[2]], l['value']] for l in g.V().has(\n",
    "        'make', make).has('model', model).outE().has('time_type', 'year').elementMap().toList()]]\n",
    "    df_year_car = pd.DataFrame(xy_year_car, columns = ['year','Vehicle_Asset'])\n",
    "    df_year_car['Vehicle_Asset'] = df_year_car['Vehicle_Asset']/1.27\n",
    "    df_year_car = df_year_car.groupby('year').mean().sort_values(by=['year'])\n",
    "#     df_year_car.index.name = None\n",
    "    df_year_car.index = [str(l) for l in df_year_car.index.values]\n",
    "    df_year_car.index = pd.to_datetime(df_year_car.index)\n",
    "    df_year_car.index.names = ['date']\n",
    "    df_year_car['Vehicle_Asset_5_Moving_Average'] = df_year_car['Vehicle_Asset'].rolling(5).mean()\n",
    "    df_year_car['Vehicle_Asset_10_Moving_Average'] = df_year_car['Vehicle_Asset'].rolling(10).mean()\n",
    "    df_year_car.reset_index(inplace= True)\n",
    "\n",
    "#     orders_df_usd = get_diff_after_n_bdays(orders_df, n_delay_days)\n",
    "\n",
    "#     tmp_df0 = orders_df_usd.copy()\n",
    "#     # display(tmp_df0.head(2))\n",
    "\n",
    "#     tmp_df0.set_index('date', inplace=True)\n",
    "#     tmp_df0.index = pd.to_datetime(tmp_df0.index)\n",
    "#     tmp_df1 = tmp_df0.groupby(['date']).agg({'price_diff_5bdays': 'mean'}).reset_index()\n",
    "#     # display(tmp_df1.head(2))\n",
    "\n",
    "#     tmp_df1.set_index('date', inplace=True)\n",
    "#     tmp_df1.index = pd.to_datetime(tmp_df1.index)\n",
    "#     dfs = df_grouping(tmp_df1)\n",
    "\n",
    "    xy_day_fx = [(y[0][list(y[0].keys())[0]], y[1]) for y in [[l[list(l.keys())[2]], l['value']] for l in g.V().hasLabel(\n",
    "        fx).outE().has('time_type', 'day').elementMap().toList()]]\n",
    "    xy_day_fx = sorted(xy_day_fx)\n",
    "    \n",
    "    if fx_inv:\n",
    "        df_day_fx = pd.DataFrame(data=[1/l[1] for l in xy_day_fx],    # values\n",
    "                              index=[l[0] for l in xy_day_fx],    # 1st column as index\n",
    "                              columns=['Financial_Asset'])\n",
    "    else:\n",
    "        df_day_fx = pd.DataFrame(data=[l[1] for l in xy_day_fx],    # values\n",
    "                              index=[l[0] for l in xy_day_fx],    # 1st column as index\n",
    "                              columns=['Financial_Asset'])\n",
    "    df_day_fx.index = [str(l)[0:4] + '-' + str(l)[4:6] + '-' + str(l)[6:8] for l in df_day_fx.index.values]\n",
    "    df_day_fx.index = pd.to_datetime(df_day_fx.index)\n",
    "    df_day_fx.index.names = ['date']\n",
    "    df_day_fx['Financial_Asset_5_Moving_Average'] = df_day_fx['Financial_Asset'].rolling(5).mean()\n",
    "    df_day_fx['Financial_Asset_10_Moving_Average'] = df_day_fx['Financial_Asset'].rolling(10).mean()\n",
    "    df_day_fx.reset_index(inplace= True)\n",
    "    df_day_fx.head(2)\n",
    "    xy_month_fx = [(y[0][list(y[0].keys())[0]], y[1]) for y in [[l[list(l.keys())[2]], l['value']] for l in g.V().hasLabel(\n",
    "        fx).outE().has('time_type', 'month').elementMap().toList()]]\n",
    "    xy_month_fx = sorted(xy_month_fx)\n",
    "    \n",
    "    if fx_inv:\n",
    "        df_month_fx = pd.DataFrame(data=[1/l[1] for l in xy_month_fx],    # values\n",
    "                                index=[l[0] for l in xy_month_fx],    # 1st column as index\n",
    "                                columns=['Financial_Asset'])\n",
    "    else:\n",
    "        df_month_fx = pd.DataFrame(data=[l[1] for l in xy_month_fx],    # values\n",
    "                                index=[l[0] for l in xy_month_fx],    # 1st column as index\n",
    "                                columns=['Financial_Asset'])\n",
    "    df_month_fx.index = [str(l)[0:4] + '-' + str(l)[4:6] for l in df_month_fx.index.values]\n",
    "    df_month_fx.index = pd.to_datetime(df_month_fx.index)\n",
    "    df_month_fx.index.names = ['date']\n",
    "    df_month_fx['Financial_Asset_5_Moving_Average'] = df_month_fx['Financial_Asset'].rolling(5).mean()\n",
    "    df_month_fx['Financial_Asset_10_Moving_Average'] = df_month_fx['Financial_Asset'].rolling(10).mean()\n",
    "    df_month_fx.reset_index(inplace= True)\n",
    "    df_month_fx.head(2)\n",
    "    xy_year_fx = [(y[0][list(y[0].keys())[0]], y[1]) for y in [[l[list(l.keys())[2]], l['value']] for l in g.V().hasLabel(\n",
    "        fx).outE().has('time_type', 'year').elementMap().toList()]]\n",
    "    xy_year_fx = sorted(xy_year_fx)\n",
    "\n",
    "    \n",
    "    if fx_inv:\n",
    "        df_year_fx = pd.DataFrame(data=[l[1] for l in xy_year_fx],    # values\n",
    "                                index=[l[0] for l in xy_year_fx],    # 1st column as index\n",
    "                                columns=['Financial_Asset'])\n",
    "    else:\n",
    "        df_year_fx = pd.DataFrame(data=[l[1] for l in xy_year_fx],    # values\n",
    "                                index=[l[0] for l in xy_year_fx],    # 1st column as index\n",
    "                                columns=['Financial_Asset'])\n",
    "    df_year_fx.index = [str(l) for l in df_year_fx.index.values]\n",
    "    df_year_fx.index = pd.to_datetime(df_year_fx.index)\n",
    "    df_year_fx.index.names = ['date']\n",
    "    df_year_fx['Financial_Asset_5_Moving_Average'] = df_year_fx['Financial_Asset'].rolling(5).mean()\n",
    "    df_year_fx['Financial_Asset_10_Moving_Average'] = df_year_fx['Financial_Asset'].rolling(10).mean()\n",
    "    df_year_fx.reset_index(inplace= True)\n",
    "\n",
    "#     display(df_year_car.head())\n",
    "#     display(df_day_fx.head())\n",
    "    \n",
    "#     dfs_car = {'daily':df_day_car, 'monthly': df_month_car, 'yearly' :df_year_car}\n",
    "#     dfs_fx = {'daily':df_day_fx, 'monthly': df_month_fx, 'yearly' :df_year_fx}\n",
    "    \n",
    "    dfs = {'daily':[df_day_car, df_day_fx], 'monthly':[df_day_car, df_month_fx], 'yearly' :[df_year_car, df_year_fx]}\n",
    "    \n",
    "#     dfs = {'daily':[df_day_car], 'monthly':[df_day_car], 'yearly' :[df_year_car]}\n",
    "    \n",
    "    \n",
    "    # display(tmp_df1.head(2))\n",
    "\n",
    "    # specify visibility for traces accross dataframes\n",
    "    frames = len(dfs)  # number of dataframes organized in  dict\n",
    "    # number of columns i df, minus 1 for Date\n",
    "    columns = len(dfs['daily'][0].columns) + len(dfs['daily'][1].columns) - 1\n",
    "    scenarios = [list(s) for s in [e == 1 for e in np.eye(frames)]]\n",
    "    visibility = [list(np.repeat(e, columns)) for e in scenarios]\n",
    "\n",
    "    # container for buttons\n",
    "    buttons = []\n",
    "\n",
    "    # iterate of dataframes in dfs:\n",
    "    # - i is used to reference visibility attributes\n",
    "    # - k is the name for each dataframe\n",
    "    # - v is the dataframe itself\n",
    "    for i, (k, vs) in enumerate(dfs.items()):\n",
    "        for j, v in enumerate(vs):\n",
    "#             print(vs)\n",
    "            for c, column in enumerate(v.columns[1:]):\n",
    "                if j == 0:\n",
    "                    fig.add_scatter(name=column,\n",
    "                                    x=v['date'],\n",
    "                                    y=v[column],\n",
    "                                    # 'daily' values are shown from the start\n",
    "                                    visible=True if k == 'daily' else False,\n",
    "                                    line=dict(color=['royalblue', \"rgb(0, 102, 204)\", \"rgb(0, 204, 204)\"][c], width=4 if c == 0 else 1)\n",
    "                                    )\n",
    "                else:\n",
    "                    fig.add_scatter(name=column,\n",
    "                                    x=v['date'],\n",
    "                                    y=v[column],\n",
    "                                    # 'daily' values are shown from the start\n",
    "                                    visible=True if k == 'daily' else False,\n",
    "                                    line=dict(color=['firebrick', \"rgb(255, 0, 0)\", \"rgb(255, 128, 0)\"][c], width=[4, 2, 1][c], dash='dash'),\n",
    "                                    secondary_y=True,\n",
    "                                    )\n",
    "\n",
    "        # one button per dataframe to trigger the visibility\n",
    "        # of all columns / traces for each dataframe\n",
    "        button = dict(label=k,\n",
    "                      method='restyle',\n",
    "                      args=['visible', visibility[i]])\n",
    "        buttons.append(button)\n",
    "#     usd_cad_df_plot = usd_cad_df.copy()\n",
    "#     usd_cad_df_plot = usd_cad_df[usd_cad_df.index > str(dfs['daily']['date'].values.min())]\n",
    "#     usd_cad_df_plot['usd_cad_diff'] = usd_cad_df_plot['Open'].diff(periods=5) #.rolling(5).mean()\n",
    "#     fig.add_scatter(x=usd_cad_df_plot.index, y=usd_cad_df_plot['Open'] * 500, name=\"usd_cad (* 500 for scale)\")\n",
    "#     fig.add_scatter(x=usd_cad_df_plot.index, y=usd_cad_df_plot['usd_cad_diff'] * 10000, name=\"usd_cad_diff (* 10000 for scale)\")\n",
    "\n",
    "    # include dropdown updatemenu in layout\n",
    "    fig.update_layout(title=f\"Financial Asset ({fx}) vs Vehicle Asset ({make_model} in USD)\",\n",
    "                      updatemenus=[dict(type=\"buttons\",\n",
    "                                        direction=\"right\",\n",
    "                                        x=0.8,\n",
    "                                        y=1.1,\n",
    "                                        buttons=buttons,\n",
    "                                        xanchor=\"left\",\n",
    "                                        yanchor=\"bottom\",\n",
    "                                        #                                     align=\"right\"\n",
    "                                        )])\n",
    "    # Set x-axis title\n",
    "    fig.update_xaxes(title_text=\"Date\")\n",
    "    fig.update_yaxes(title_text=\"<b>Vehicle Asset</b> (USD)\", secondary_y=False)\n",
    "    fig.update_yaxes(title_text=\"<b>Financial Asset</b>\", secondary_y=True)\n",
    "    return fig\n",
    "# app.run_server(port=8050)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 29,
   "metadata": {},
   "outputs": [],
   "source": [
    "# app.run_server(mode='inline', port=8050)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 30,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Dash app running on http://127.0.0.1:8050/\n"
     ]
    }
   ],
   "source": [
    "app.run_server(port=8050)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 42,
   "metadata": {},
   "outputs": [],
   "source": [
    "import time\n",
    "while True:\n",
    "    time.sleep(999)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 39,
   "metadata": {},
   "outputs": [],
   "source": [
    "# app._terminate_server_for_port(\"localhost\", 8050)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# FIN"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 32,
   "metadata": {},
   "outputs": [],
   "source": [
    "# [(y[0][list(y[0].keys())[0]], y[1]) for y in [[l[list(l.keys())[2]], l['value']] for l in g.V().hasLabel(\n",
    "#         'USDCAD').outE().has('time_type', 'day').elementMap().toList()]]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 33,
   "metadata": {},
   "outputs": [],
   "source": [
    "# set([x['location'] for x in g.V().has('node_type', 'car').elementMap().toList()])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 34,
   "metadata": {},
   "outputs": [],
   "source": [
    "# len([x['location'] for x in g.V().has('node_type', 'car').elementMap().toList()  if x['location'] == 'CA_default'])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 35,
   "metadata": {},
   "outputs": [],
   "source": [
    "# len([x['location'] for x in g.V().has('node_type', 'car').elementMap().toList()  if x['location'] == 'CA_us'])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 36,
   "metadata": {},
   "outputs": [],
   "source": [
    "# len([x['location'] for x in g.V().has('node_type', 'car').elementMap().toList()  if x['location'] == 'UAE_default'])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 37,
   "metadata": {},
   "outputs": [],
   "source": [
    "# default_txms = 'TOYOTA.Corolla.2020.4D_SEDAN_LE.Canada_Spec'\n",
    "# # default_txms = 'TOYOTA.Corolla.2018.4D_SEDAN_SE.Canada_Spec'\n",
    "# app = JupyterDash(__name__)\n",
    "# app.layout = html.Div([\n",
    "#     html.H1(\"Baseline Price of CarType in USD\"),\n",
    "#     dcc.Graph(id='graph'),\n",
    "#     html.Label([\n",
    "#         \"Make\",\n",
    "#         dcc.Dropdown(\n",
    "#             id='make-dropdown', clearable=False,\n",
    "#             value=makes_list[0], options=[\n",
    "#                 {'label': c, 'value': c}\n",
    "#                 for c in makes_list\n",
    "#             ]),\n",
    "#         \"Model\",\n",
    "#         dcc.Dropdown(\n",
    "#             id='model-dropdown', clearable=False,\n",
    "#             value=models_list[0], options=[\n",
    "#                 {'label': c, 'value': c}\n",
    "#                 for c in models_list\n",
    "#             ]),\n",
    "#         \"Year\",\n",
    "#         dcc.Dropdown(\n",
    "#             id='year-dropdown', clearable=False,\n",
    "#             value=years_list[0], options=[\n",
    "#                 {'label': c, 'value': c}\n",
    "#                 for c in years_list\n",
    "#             ]),\n",
    "#         \"Trim\",\n",
    "#         dcc.Dropdown(\n",
    "#             id='trim-dropdown', clearable=False,\n",
    "#             value=trims_list[0], options=[\n",
    "#                 {'label': c, 'value': c}\n",
    "#                 for c in trims_list\n",
    "#             ]),\n",
    "#         \"TXMS (CarType)\",\n",
    "#         dcc.Dropdown(\n",
    "#             id='txms-dropdown', clearable=False,\n",
    "#             value=default_txms, options=[\n",
    "#                 {'label': c, 'value': c}\n",
    "#                 for c in txms_list\n",
    "#             ]),\n",
    "#         \"Location\",\n",
    "#         dcc.Dropdown(\n",
    "#             id='location-dropdown', clearable=False,\n",
    "#             value=locations_list[0], options=[\n",
    "#                 {'label': c, 'value': c}\n",
    "#                 for c in locations_list\n",
    "#             ]),\n",
    "#         \"FOREX\",\n",
    "#         dcc.Dropdown(\n",
    "#             id='fx-dropdown', clearable=False,\n",
    "#             value='EURUSD', options=[\n",
    "#                 {'label': c, 'value': c}\n",
    "#                 for c in ['EURUSD', 'USDCAD', 'USDMXN', 'USDZAR']\n",
    "#             ]),\n",
    "#     ]),\n",
    "# ])\n",
    "\n",
    "# # Define callback to update graph\n",
    "# @app.callback(\n",
    "#     Output('graph', 'figure'),\n",
    "#     [Input(\"make-dropdown\", \"value\"), Input(\"model-dropdown\", \"value\"), Input(\"year-dropdown\", \"value\"), Input(\"trim-dropdown\", \"value\"), \n",
    "#      Input(\"txms-dropdown\", \"value\"), Input(\"location-dropdown\", \"value\"), Input(\"fx-dropdown\", \"value\")]\n",
    "# )\n",
    "# def update_figure(make, model, year, trim, txms, location, fx):\n",
    "#     makes_list = list(set([x['make'] for x in g.V().has('node_type', 'CarType').elementMap().toList()]))\n",
    "#     models_list = list(set([x['model'] for x in g.V().has('node_type', 'CarType').elementMap().toList()]))\n",
    "#     years_list = list(set([x['year'] for x in g.V().has('node_type', 'CarType').elementMap().toList()]))\n",
    "#     trims_list = list(set([x['trim'] for x in g.V().has('node_type', 'CarType').elementMap().toList()]))\n",
    "#     locations_list = ['CA_default', 'CA_us']\n",
    "#     txms_list = list(set([x[list(x.keys())[1]] for x in g.V().has('node_type', 'CarType').elementMap().toList()]))\n",
    "# #     fig = go.Figure(specs=[[{\"secondary_y\": True}]])\n",
    "#     fig = make_subplots(specs=[[{\"secondary_y\": True}]])\n",
    "#     xy_day_car = [(y[0][list(y[0].keys())[0]], y[1]) for y in [[l[list(l.keys())[2]], l['value']] for l in g.V().hasLabel(\n",
    "#     txms).outE().has('time_type', 'day').elementMap().toList()]]\n",
    "#     xy_day_car = sorted(xy_day_car)\n",
    "\n",
    "#     df_day_car = pd.DataFrame(data=[l[1] for l in xy_day_car],    # values\n",
    "#                           index=[l[0] for l in xy_day_car],    # 1st column as index\n",
    "#                           columns=['Cars_Baseline_Price'])\n",
    "#     df_day_car.index = [str(l)[0:4] + '-' + str(l)[4:6] + '-' + str(l)[6:8] for l in df_day_car.index.values]\n",
    "#     df_day_car.index = pd.to_datetime(df_day_car.index)\n",
    "#     df_day_car.index.names = ['date']\n",
    "#     df_day_car['Cars_Baseline_Price_5_Moving_Average'] = df_day_car['Cars_Baseline_Price'].rolling(5).mean()\n",
    "#     df_day_car['Cars_Baseline_Price_10_Moving_Average'] = df_day_car['Cars_Baseline_Price'].rolling(10).mean()\n",
    "#     df_day_car.reset_index(inplace= True)\n",
    "\n",
    "#     xy_month_car = [(y[0][list(y[0].keys())[0]], y[1]) for y in [[l[list(l.keys())[2]], l['value']] for l in g.V().hasLabel(\n",
    "#         txms).outE().has('time_type', 'month').elementMap().toList()]]\n",
    "#     xy_month_car = sorted(xy_month_car)\n",
    "\n",
    "#     df_month_car = pd.DataFrame(data=[l[1] for l in xy_month_car],    # values\n",
    "#                             index=[l[0] for l in xy_month_car],    # 1st column as index\n",
    "#                             columns=['Cars_Baseline_Price'])\n",
    "#     df_month_car.index = [str(l)[0:4] + '-' + str(l)[4:6] for l in df_month_car.index.values]\n",
    "#     df_month_car.index = pd.to_datetime(df_month_car.index)\n",
    "#     df_month_car.index.names = ['date']\n",
    "#     df_month_car['Cars_Baseline_Price_5_Moving_Average'] = df_month_car['Cars_Baseline_Price'].rolling(5).mean()\n",
    "#     df_month_car['Cars_Baseline_Price_10_Moving_Average'] = df_month_car['Cars_Baseline_Price'].rolling(10).mean()\n",
    "#     df_month_car.reset_index(inplace= True)\n",
    "\n",
    "#     xy_year_car = [(y[0][list(y[0].keys())[0]], y[1]) for y in [[l[list(l.keys())[2]], l['value']] for l in g.V().hasLabel(\n",
    "#         txms).outE().has('time_type', 'year').elementMap().toList()]]\n",
    "#     xy_year_car = sorted(xy_year_car)\n",
    "\n",
    "#     df_year_car = pd.DataFrame(data=[l[1] for l in xy_year_car],    # values\n",
    "#                             index=[l[0] for l in xy_year_car],    # 1st column as index\n",
    "#                             columns=['Cars_Baseline_Price'])\n",
    "#     df_year_car.index = [str(l) for l in df_year_car.index.values]\n",
    "#     df_year_car.index = pd.to_datetime(df_year_car.index)\n",
    "#     df_year_car.index.names = ['date']\n",
    "#     df_year_car['Cars_Baseline_Price_5_Moving_Average'] = df_year_car['Cars_Baseline_Price'].rolling(5).mean()\n",
    "#     df_year_car['Cars_Baseline_Price_10_Moving_Average'] = df_year_car['Cars_Baseline_Price'].rolling(10).mean()\n",
    "#     df_year_car.reset_index(inplace= True)\n",
    "\n",
    "# #     orders_df_usd = get_diff_after_n_bdays(orders_df, n_delay_days)\n",
    "\n",
    "# #     tmp_df0 = orders_df_usd.copy()\n",
    "# #     # display(tmp_df0.head(2))\n",
    "\n",
    "# #     tmp_df0.set_index('date', inplace=True)\n",
    "# #     tmp_df0.index = pd.to_datetime(tmp_df0.index)\n",
    "# #     tmp_df1 = tmp_df0.groupby(['date']).agg({'price_diff_5bdays': 'mean'}).reset_index()\n",
    "# #     # display(tmp_df1.head(2))\n",
    "\n",
    "# #     tmp_df1.set_index('date', inplace=True)\n",
    "# #     tmp_df1.index = pd.to_datetime(tmp_df1.index)\n",
    "# #     dfs = df_grouping(tmp_df1)\n",
    "\n",
    "#     xy_day_fx = [(y[0][list(y[0].keys())[0]], y[1]) for y in [[l[list(l.keys())[2]], l['value']] for l in g.V().hasLabel(\n",
    "#         fx).outE().has('time_type', 'day').elementMap().toList()]]\n",
    "#     xy_day_fx = sorted(xy_day_fx)\n",
    "\n",
    "#     df_day_fx = pd.DataFrame(data=[l[1] for l in xy_day_fx],    # values\n",
    "#                           index=[l[0] for l in xy_day_fx],    # 1st column as index\n",
    "#                           columns=['FX_Value'])\n",
    "#     df_day_fx.index = [str(l)[0:4] + '-' + str(l)[4:6] + '-' + str(l)[6:8] for l in df_day_fx.index.values]\n",
    "#     df_day_fx.index = pd.to_datetime(df_day_fx.index)\n",
    "#     df_day_fx.index.names = ['date']\n",
    "#     df_day_fx['FX_Value_5_Moving_Average'] = df_day_fx['FX_Value'].rolling(5).mean()\n",
    "#     df_day_fx['FX_Value_10_Moving_Average'] = df_day_fx['FX_Value'].rolling(10).mean()\n",
    "#     df_day_fx.reset_index(inplace= True)\n",
    "#     df_day_fx.head(2)\n",
    "#     xy_month_fx = [(y[0][list(y[0].keys())[0]], y[1]) for y in [[l[list(l.keys())[2]], l['value']] for l in g.V().hasLabel(\n",
    "#         fx).outE().has('time_type', 'month').elementMap().toList()]]\n",
    "#     xy_month_fx = sorted(xy_month_fx)\n",
    "\n",
    "#     df_month_fx = pd.DataFrame(data=[l[1] for l in xy_month_fx],    # values\n",
    "#                             index=[l[0] for l in xy_month_fx],    # 1st column as index\n",
    "#                             columns=['FX_Value'])\n",
    "#     df_month_fx.index = [str(l)[0:4] + '-' + str(l)[4:6] for l in df_month_fx.index.values]\n",
    "#     df_month_fx.index = pd.to_datetime(df_month_fx.index)\n",
    "#     df_month_fx.index.names = ['date']\n",
    "#     df_month_fx['FX_Value_5_Moving_Average'] = df_month_fx['FX_Value'].rolling(5).mean()\n",
    "#     df_month_fx['FX_Value_10_Moving_Average'] = df_month_fx['FX_Value'].rolling(10).mean()\n",
    "#     df_month_fx.reset_index(inplace= True)\n",
    "#     df_month_fx.head(2)\n",
    "#     xy_year_fx = [(y[0][list(y[0].keys())[0]], y[1]) for y in [[l[list(l.keys())[2]], l['value']] for l in g.V().hasLabel(\n",
    "#         fx).outE().has('time_type', 'year').elementMap().toList()]]\n",
    "#     xy_year_fx = sorted(xy_year_fx)\n",
    "\n",
    "#     df_year_fx = pd.DataFrame(data=[l[1] for l in xy_year_fx],    # values\n",
    "#                             index=[l[0] for l in xy_year_fx],    # 1st column as index\n",
    "#                             columns=['FX_Value'])\n",
    "#     df_year_fx.index = [str(l) for l in df_year_fx.index.values]\n",
    "#     df_year_fx.index = pd.to_datetime(df_year_fx.index)\n",
    "#     df_year_fx.index.names = ['date']\n",
    "#     df_year_fx['FX_Value_5_Moving_Average'] = df_year_fx['FX_Value'].rolling(5).mean()\n",
    "#     df_year_fx['FX_Value_10_Moving_Average'] = df_year_fx['FX_Value'].rolling(10).mean()\n",
    "#     df_year_fx.reset_index(inplace= True)\n",
    "\n",
    "# #     display(df_year_car.head())\n",
    "# #     display(df_day_fx.head())\n",
    "    \n",
    "# #     dfs_car = {'daily':df_day_car, 'monthly': df_month_car, 'yearly' :df_year_car}\n",
    "# #     dfs_fx = {'daily':df_day_fx, 'monthly': df_month_fx, 'yearly' :df_year_fx}\n",
    "    \n",
    "#     dfs = {'daily':[df_day_car, df_day_fx], 'monthly':[df_day_car, df_month_fx], 'yearly' :[df_year_car, df_year_fx]}\n",
    "    \n",
    "# #     dfs = {'daily':[df_day_car], 'monthly':[df_day_car], 'yearly' :[df_year_car]}\n",
    "    \n",
    "    \n",
    "#     # display(tmp_df1.head(2))\n",
    "\n",
    "#     # specify visibility for traces accross dataframes\n",
    "#     frames = len(dfs)  # number of dataframes organized in  dict\n",
    "#     # number of columns i df, minus 1 for Date\n",
    "#     columns = len(dfs['daily'][0].columns) + len(dfs['daily'][1].columns) - 1\n",
    "#     scenarios = [list(s) for s in [e == 1 for e in np.eye(frames)]]\n",
    "#     visibility = [list(np.repeat(e, columns)) for e in scenarios]\n",
    "\n",
    "#     # container for buttons\n",
    "#     buttons = []\n",
    "\n",
    "#     # iterate of dataframes in dfs:\n",
    "#     # - i is used to reference visibility attributes\n",
    "#     # - k is the name for each dataframe\n",
    "#     # - v is the dataframe itself\n",
    "#     for i, (k, vs) in enumerate(dfs.items()):\n",
    "#         for j, v in enumerate(vs):\n",
    "# #             print(vs)\n",
    "#             for c, column in enumerate(v.columns[1:]):\n",
    "#                 if j == 0:\n",
    "#                     fig.add_scatter(name=column,\n",
    "#                                     x=v['date'],\n",
    "#                                     y=v[column],\n",
    "#                                     # 'daily' values are shown from the start\n",
    "#                                     visible=True if k == 'daily' else False\n",
    "#                                     )\n",
    "#                 else:\n",
    "#                     fig.add_scatter(name=column,\n",
    "#                                     x=v['date'],\n",
    "#                                     y=v[column],\n",
    "#                                     # 'daily' values are shown from the start\n",
    "#                                     visible=True if k == 'daily' else False,\n",
    "#                                     secondary_y=True,\n",
    "#                                     )\n",
    "\n",
    "#         # one button per dataframe to trigger the visibility\n",
    "#         # of all columns / traces for each dataframe\n",
    "#         button = dict(label=k,\n",
    "#                       method='restyle',\n",
    "#                       args=['visible', visibility[i]])\n",
    "#         buttons.append(button)\n",
    "# #     usd_cad_df_plot = usd_cad_df.copy()\n",
    "# #     usd_cad_df_plot = usd_cad_df[usd_cad_df.index > str(dfs['daily']['date'].values.min())]\n",
    "# #     usd_cad_df_plot['usd_cad_diff'] = usd_cad_df_plot['Open'].diff(periods=5) #.rolling(5).mean()\n",
    "# #     fig.add_scatter(x=usd_cad_df_plot.index, y=usd_cad_df_plot['Open'] * 500, name=\"usd_cad (* 500 for scale)\")\n",
    "# #     fig.add_scatter(x=usd_cad_df_plot.index, y=usd_cad_df_plot['usd_cad_diff'] * 10000, name=\"usd_cad_diff (* 10000 for scale)\")\n",
    "\n",
    "#     # include dropdown updatemenu in layout\n",
    "#     fig.update_layout(title=f\"Baseline Price of CarType {txms} in USD\",\n",
    "#                       updatemenus=[dict(type=\"buttons\",\n",
    "#                                         direction=\"right\",\n",
    "#                                         x=0.8,\n",
    "#                                         y=1.1,\n",
    "#                                         buttons=buttons,\n",
    "#                                         xanchor=\"left\",\n",
    "#                                         yanchor=\"bottom\",\n",
    "#                                         #                                     align=\"right\"\n",
    "#                                         )])\n",
    "#     # Set x-axis title\n",
    "#     fig.update_xaxes(title_text=\"Date\")\n",
    "#     fig.update_yaxes(title_text=\"<b>Baseline Price</b> (USD)\", secondary_y=False)\n",
    "#     fig.update_yaxes(title_text=\"<b>FX Value</b>\", secondary_y=True)\n",
    "#     return fig\n",
    "# app.run_server(port=8050)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 38,
   "metadata": {},
   "outputs": [],
   "source": [
    "# 26/7073 * 100"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.8.10"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 4
}
